Revit 2018 API
Application.Assets Property
Returns a set of all the Assets within Revit of special type.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public AssetSet this[
	AssetType A_0
] { get; }
Visual Basic
Public ReadOnly Property Assets ( _
	A_0 As AssetType _
) As AssetSet
	Get
Visual C++
public:
property AssetSet^ Assets[AssetType A_0] {
	AssetSet^ get (AssetType A_0);
}
Parameters
A_0
Type: Autodesk.Revit.DB.Visual.AssetType
Remarks
Each Asset stores the information for rendering etc.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace